**Desafio 1**

In [3]:
import pandas as pd
import numpy as np

In [15]:
array_1_y_50 = np.linspace(1,50,dtype="int")

In [16]:
array_1_y_50

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50])

In [14]:
array_50_y_150 = np.linspace(50,150,dtype="int")
array_50_y_150

array([ 50,  52,  54,  56,  58,  60,  62,  64,  66,  68,  70,  72,  74,
        76,  78,  80,  82,  84,  86,  88,  90,  92,  94,  96,  98, 101,
       103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127,
       129, 131, 133, 135, 137, 139, 141, 143, 145, 147, 150])

**Desafio 2**

In [17]:
for i in array_1_y_50:
    if i%2==0:
        print(f"{i} es par")

2 es par
4 es par
6 es par
8 es par
10 es par
12 es par
14 es par
16 es par
18 es par
20 es par
22 es par
24 es par
26 es par
28 es par
30 es par
32 es par
34 es par
36 es par
38 es par
40 es par
42 es par
44 es par
46 es par
48 es par
50 es par

**Desafio 3**

In [2]:
import pandas as pd
import numpy as np
array_50_y_150 = np.linspace(50,150,dtype="int")

In [4]:
multiplo_2_or_3 = 0
multiplo_2_and_3 = 0
solo_multiplo_de_3 = 0
no_multiplo_2_ni_3 = 0

for i in array_50_y_150:
    if i%2 == 0 or i%3==0:
        multiplo_2_or_3 += 1
    if i%2==0 and i%3 == 0:
        multiplo_2_and_3 += 1
    if i%3 == 0 and i%2 != 0: 
        solo_multiplo_de_3 += 1
    if i%2 != 0 and i%3 != 0:
        no_multiplo_2_ni_3 += 1

print(f"Cantidad de números divisibles por 2 o 3: {multiplo_2_or_3}") 
print(f"Cantidad de números divisibles por 2 y 3: {multiplo_2_and_3}") 
print(f"Cantidad de números divisibles por 3 pero no por 2: {solo_multiplo_de_3}") 
print(f"Cantidad de números que no son divisibles por 2 ni 3: {no_multiplo_2_ni_3}")

Cantidad de números divisibles por 2 o 3: 34
Cantidad de números divisibles por 2 y 3: 9
Cantidad de números divisibles por 3 pero no por 2: 8
Cantidad de números que no son divisibles por 2 ni 3: 16

**Desafio 4**

Corrección de errores

In [5]:
for​ i ​in​ range(​100​): 
   print(I**​2​)

SyntaxError: invalid character in identifier (<ipython-input-5-d3fb720993ec>, line 1)

El error se debe a que python nota la diferencia entre mayusculas y minusculas, y la variable del for es i y no I, como se llama dentro del ciclo for. 
A continuación dejo el codigo corregido.

In [8]:
for i in range(100): 
   print(i**2)

0
1
4
9
16
25
36
49
64
81
100
121
144
169
196
225
256
289
324
361
400
441
484
529
576
625
676
729
784
841
900
961
1024
1089
1156
1225
1296
1369
1444
1521
1600
1681
1764
1849
1936
2025
2116
2209
2304
2401
2500
2601
2704
2809
2916
3025
3136
3249
3364
3481
3600
3721
3844
3969
4096
4225
4356
4489
4624
4761
4900
5041
5184
5329
5476
5625
5776
5929
6084
6241
6400
6561
6724
6889
7056
7225
7396
7569
7744
7921
8100
8281
8464
8649
8836
9025
9216
9409
9604
9801

**Desafio 5**

In [10]:
df = pd.read_csv("flights.csv")
df

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [12]:
mean_passenger = df["passengers"].mean()

In [20]:
mean_passenger

280.2986111111111

In [15]:
new_df = df.assign(underperforming = 0)

In [16]:
new_df

     year      month  passengers  underperforming
0    1949    January         112                0
1    1949   February         118                0
2    1949      March         132                0
3    1949      April         129                0
4    1949        May         121                0
..    ...        ...         ...              ...
139  1960     August         606                0
140  1960  September         508                0
141  1960    October         461                0
142  1960   November         390                0
143  1960   December         432                0

[144 rows x 4 columns]

In [23]:
index = 0
for i in df["passengers"]:
    if i < mean_passenger:
        new_df.at[index, "underperforming"] = 1
    index += 1

In [24]:
new_df

     year      month  passengers  underperforming
0    1949    January         112                1
1    1949   February         118                1
2    1949      March         132                1
3    1949      April         129                1
4    1949        May         121                1
..    ...        ...         ...              ...
139  1960     August         606                0
140  1960  September         508                0
141  1960    October         461                0
142  1960   November         390                0
143  1960   December         432                0

[144 rows x 4 columns]

**Desafio 6**

In [34]:
mean_passenger = df["passengers"].mean()
std_passenger = df["passengers"].std()

In [35]:
new2_df = df.assign(outlier = 0)
new2_df

     year      month  passengers  outlier
0    1949    January         112        0
1    1949   February         118        0
2    1949      March         132        0
3    1949      April         129        0
4    1949        May         121        0
..    ...        ...         ...      ...
139  1960     August         606        0
140  1960  September         508        0
141  1960    October         461        0
142  1960   November         390        0
143  1960   December         432        0

[144 rows x 4 columns]

In [38]:
index = 0
for i in new2_df["passengers"]:
    if (i < (mean_passenger-std_passenger)) or (i > (mean_passenger + std_passenger)):
        new2_df.at[index,"outlier"] = 1
        
    index += 1

In [39]:
new2_df

     year      month  passengers  outlier
0    1949    January         112        1
1    1949   February         118        1
2    1949      March         132        1
3    1949      April         129        1
4    1949        May         121        1
..    ...        ...         ...      ...
139  1960     August         606        1
140  1960  September         508        1
141  1960    October         461        1
142  1960   November         390        0
143  1960   December         432        1

[144 rows x 4 columns]

Conteo de casos extremos

In [40]:
cont = 0
for i in new2_df["outlier"]:
    if i == 1:
        cont += 1 
cont

53

Del total de la muestra 53 son casos extremos.